package chap03;
/*
 * 이항연산자
 * 비트연산자 : &(AND),|(OR),^(XOR), ~(NOT)
 */
public class OpEx05 {
	public static void main(String[] args) {
		System.out.println(6&3);
		/*
		 * 6 : 00000110
		 * 3 : 00000011
		 * =============
		 * & : 00000010 => 2
		 */
		System.out.println(6|3);
		/*
		 * 6 : 00000110
		 * 3 : 00000011
		 * =============
		 * | : 00000111 => 7
		 */
		System.out.println(6^3);
		/*
		 * 6 : 00000110
		 * 3 : 00000011
		 * =============
		 * ^ : 00000101 => 5
		 */
		
		System.out.println(~10);
		/*
		 * 10 : 00001010
		 * ==============
		 * ~  : 11110101  
		 *     (-)
		 *        1110101 : x의 2의 보수
		 * 1의보수  0001010 
		 * 2의보수  0001011 : x=11  
		 * 
		 * 자바에서 음수는 2의 보수로 표현함.
		 * 2의 보수 <= 1의보수 + 1
		 */
	}
}
